{
  "laura": {
    "subGallery": true,
    "marqueeImage": "img/marquee/laura.jpg",
    "galleryTitle": "HeyLaura",
    "galleryURL": "http://tylershambora.com/dev/laura/",
    "galleryURLAppearance": "www.heylaura.com",
    "galleryStatus": "online",
    "galleryDescription": "I worked with Author/Editor, Laura McClure to help design and develop her portfolio website in order to showcase her work and her involvement helping Africans. The site features no page reloads, jQuery animations to transition between content, and a number of other cool features.",
    "additionalGalleries": [
      [true, "right-image border", "laura/laura-about.jpg", "This project was my first exposure to using JavaScript as an integral part of the site. In addition to the page transitions, other JS features include: auto-looping slide show on the 'Articles' page, randomly generated tag-line above the footer, and a contact form that passes along its data via. AJAX.<br><br><strong>Fun Fact:</strong> While my portfolio is inspired by this site, the animations you see on my site are done using CSS3, not JavaScript."],
      [true, "left-image push-down-text laura-logo", "laura/logo.jpg", "Besides gaining a grasp on JavaScript, another goal in completing this project was develop my visual design ability, and to ultimately produce something that looked nice. It was also my first experience working with a client and trying to interpret and develop their vision into a website.<br><br>It ended up being a more difficult process than I had initially anticipated, but it was a great learning experience and taught me that design is harder than it looks, and working with a client is very different from working by yourself."],
      [true, "right-image border half-push-down-text", "laura/laura-contact.jpg", "Unfortunately, the site is no longer alive at it's original domain. Laura recently decided to renew her web offering, which meant my site had to be replaced. Luckily for you and me, I had an extra copy lying around that I put up on my server. While there are a few gaps where content should be, and maybe one or two dead links, I think the general idea remains intact. Head on over to <a href='http://heylaura.com' target='_blank'>heylaura.com</a> to see the site live on forever, in all its glory."]
    ]
  },
  "resizely": {
    "subGallery": true,
    "marqueeImage": "img/marquee/resize.ly.jpg",
    "galleryTitle": "resize.ly",
    "galleryURL": "http://resize.ly",
    "galleryURLAppearance": "www.resize.ly",
    "galleryStatus": "online",
    "galleryDescription": "<a href='http://resize.ly' target='_blank'>Resize.ly</a> was my capstone project for my master's at The George Washington University. Resize.ly is a web service that resizes any image you host simply by providing a custom URL. It's great for developers who want retina ready, resized images, but don't want to be continually opening Photoshop simply to adjust the size of their images.",
    "additionalGalleries": [
      [false, "top-image resizely-bottom-image", "resize.ly/resize.ly-bottom.jpg", "I was responsible for the visual design and the front-end development of the site. The site is built upon the Twitter Bootstrap framework, which was a great experience for me as I was introduced to two very important web development concepts: grids and responsive web design."],
      [false, "top-image", "resize.ly/test.jpg", "This was an idea I had while mocking up the site that we eventually decided to implement. It's an in-page tool that allows you to test out the service and resize any image online to the specified dimensions."]
    ]
  },
  "sns": {
    "subGallery": true,
    "marqueeImage": "img/marquee/sns.jpg",
    "galleryTitle": "Speaker Noise Society",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "offline",
    "galleryDescription": "Speaker Noise Society was one of two music blogs that I helped admin over the course of two or three years. The site was built on top of a Wordpress installation deployed on my server, and used a custom Wordpress theme that I both designed and developed. While the blog is no longer online, it has since evolved into <a href='https://www.facebook.com/makeitfunkysf' target='_blank'>Make it Funky</a> over on Facebook.",
    "additionalGalleries": [
      [true, "right-image double-push-down-text", "sns/sns-logo.jpg", "Never missing an opportunity to do a little creative work, I decided to design the Speaker Noise Society Logo. While I initially saw this as an opportunity to learn Adobe Illustrator, the whole process quickly turned into a disaster. The experience was so traumatizing to me that I haven't opened the application since."]
    ]
  },
  "petershambora": {
    "subGallery": true,
    "marqueeImage": "img/marquee/petershambora.jpg",
    "galleryTitle": "Peter Shambora",
    "galleryURL": "http://petershambora.com",
    "galleryURLAppearance": "www.petershambora.com",
    "galleryStatus": "online",
    "galleryDescription": "<a href='http://petershambora.com' target='_blank'>PeterShambora.com</a> was one of my first websites, and was really just an excuse to practice writing markup. In spite of that, I honestly think that this is one of my cooler sites. My favorite part are the links in the resume that jump you to the associated content on the page.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "petershambora/petershambora-about.jpg", "Like most of my other sites, in addition to giving me an opportunity to practicing writing markup, the site also gave me an opportunity to work on my design skills. The paper boats in the logo are an homage to my dad's fondness for boating."]
    ]
  },
  "fb": {
    "subGallery": true,
    "marqueeImage": "img/marquee/fb.jpg",
    "galleryTitle": "Fresh B33ts",
    "galleryURL": "http://freshb33ts.com",
    "galleryURLAppearance": "www.freshb33ts.com",
    "galleryStatus": "online",
    "galleryDescription": "<a href='http://freshb33ts.com' target='_blank'>FreshB33ts.com</a> is the second of two music blogs that I helped admin and make sure didn't explode. The site actually had a pretty good run and even has posts dating back to 2009. I had a really good time keeping watch over FreshB33ts and because of my soft spot for the site, I've tried to keep it up and running as long as possible.",
    "additionalGalleries": [
      [true, "right-image", "fb/fb-logo.jpg", "As you may have noticed by now, I'd like to think that I'm very capable logo design. This apparently makes me qualified to design every logo for every website I author. I didn't actually author FreshB33ts as it runs on Blogger, but that didn't stop me from designing the logo."]
    ]
  },
  "papn": {
    "subGallery": true,
    "marqueeImage": "img/marquee/papn.jpg",
    "galleryTitle": "Palo Alto Party Network",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "offline",
    "galleryDescription": "Palo Alto Party Network was the first website I ever built. What originally started out as a project integrating WYSIWYG editors with the CMS developed at the company I was interning at, eventually turned into my introduction to web development. The site featured announcements about upcoming parties, a photo gallery from past parties, and a way to buy tickets online.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "papn/papn1.jpg", "Because the site was built using Softpress' Freeway editor, I wasn't exposed to writing or editing any markup. That meant for this site, I was able to focus exclusively on the visual aspect. Looking back on it, I had no idea what I was doing. While the site may have looked nice, from a usability standpoint it was a nightmare."],
      [true, "left-image border push-down-text", "papn/papn2.jpg", "In addition to the website, Palo Alto Party Network also had an accompanying Facebook Page and Twitter feed, both of which I managed. "]
    ]
  },
  "csh": {
    "subGallery": true,
    "marqueeImage": "img/marquee/csh.jpg",
    "galleryTitle": "Casa Street Hooligans",
    "galleryURL": "http://casastreethooligans.com",
    "galleryURLAppearance": "www.casastreethooligans.com",
    "galleryStatus": "online",
    "galleryDescription": "Casa Street Hooligans was another site I built as an excuse to practice writing markup. It's based on a carousel tutorial I found and tried to rebuild. Despite being one of my earlier sites, to this day I'm still pretty pleased with the results.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "csh/csh-bio.jpg", "This is what one of the bio pages looked like. It had: the group member's name, a brief bio, and a way to get into contact with them (along with navigation along the bottom). "],
      [true, "left-image border push-down-text", "csh/csh-music.jpg", "Then after all the bios, there was a slide that had Soundcloud widgets embedded into the slide so people could listen to the different group member's music."],
      [true, "right-image border push-down-text", "csh/csh-contact.jpg", "Finally, the last slide had a nice little grid if you wanted to get into contact with the collective group (instead of an individual member)."]
    ]
  },
  "wtfdrink": {
    "subGallery": true,
    "marqueeImage": "img/marquee/wtfdrink.jpg",
    "galleryTitle": "WTFDrink",
    "galleryURL": "http://wtfdrink.com",
    "galleryURLAppearance": "www.wtfdrink.com",
    "galleryStatus": "online",
    "galleryDescription": "WTFDrink.com has been my pet project since I started making websites. Initially, the site started out as some basic HTML/CSS + Javascript that I whipped up. However, since then, I've learned some new languages and now the site runs PHP with a MySQL database. It also utilized at one point the new Facebook OpenGraph API and could make posts on your timeline, but unfortunately, Facebook changes their API and the way their stuff works so often, the feature would break like every 36 hours.",
    "additionalGalleries": [
      [true, "right-image border", "wtfdrink/wtfdrink1.jpg", "So the long url for the site is <a href='http://whatthefuckshouldidrinktonight.com' target='_blank'class='lengthy-url'>whatthefuckshouldidrinktonight</a>, but I figured that was way too long for people to type in to their browsers if they ever wanted to access the site, so you can also get to the site by typing <a href='http://wtfdrink.com' target='_blank'>wtfdrink.com</a>."],
      [true, "left-image border", "wtfdrink/wtfdrink2.jpg", "If you don't drink alcohol, don't fret, there's a section of the site just for you. If you click on 'I don't wanna fucking drink alcohol' you'll be shown a list of drinks that don't contain alcohol."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink3.jpg", "Just as further proof that Fresca isn't the only non-alcoholic option, here's a suggestion for a Shirley Temple!"],
      [true, "left-image border", "wtfdrink/wtfdrink4.jpg", "If you prefer Spanish try, <a href='http://whatthefuckshouldIdrinkestanoche.com' target='_blank'class='massive-url'>whatthefuckshouldidrinkestanoche</a>, and see what kind of options you get in Spanish. While the drinks may not be different, the language certainly is."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink5.jpg", "See, I told you! I wasn't lying! Real life, actual Spanish!"],
      [true, "left-image border", "wtfdrink/wtfdrink6.jpg", "If you're not really in the mood to make a drink, but just want help choosing what kind of liquor you want to drink on any given night, try going to <a href='http://simple.wtfdrink.com' target='_blank'>simple.wtfdrink.com</a>. This version of the site will simply give you a type of liquor that you should try drinking. Nothing more, nothing less."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink7.jpg", "If the site still doesn't make sense to you and you still can't figure out what the point of it is, check out the 'About' page and maybe things will become a little more clear for you..."],
      [true, "left-image border", "wtfdrink/wtfdrink8.jpg", "I can't take credit for coming up with the idea on my own. About the time I thought of wtfdrink there were a number of <a href='http://whatthefuckshouldimakefordinner.com' target='_blank'>'whatthefuckshould-.com'</a> sites making the rounds on the Internet. This particular site was the one that got it all started for me, so I thought I'd give it a shout out here on my portfolio page."],
      [true, "right-image border", "wtfdrink/wtfdrink-FB.jpg", "IF/WHEN Facebook decides to be cool and not keep changing everything, this is how the timeline app should look on a person's timeline. That said, WHEN/IF are two very specific conditions that have to be met, which as far as I can tell, aren't met very often."]
    ]
  },
  "cpsolutions": {
    "subGallery": true,
    "marqueeImage": "img/marquee/cpsolutions.jpg",
    "galleryTitle": "CP Solutions",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "mock-up",
    "galleryDescription": "CP Solutions Consulting was a mock-up I did for my sister for her consulting firm when she was considering pursuing a website. Fortunately (or unfortunately, depending on how you look at it) she ended up not needing a website, but I was particularly proud of the work that I had done and I think it was deserving of being shown.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "cpsolutions/cpsolutions-mock.jpg", "This is an image of the Photoshop mock-up still being worked on inside of PS, before a rapid prototype had been built in HTML."],
      [true, "left-image border push-down-text", "cpsolutions/cpsolutions-page.jpg",  "After it's all said and done, this is the rapid mock-up of what the homepage would look like. Not to shabby."]
    ]
  },
  "resume": {
    "subGallery": false,
    "marqueeImage": "img/marquee/resume.jpg",
    "galleryTitle": "Resume",
    "galleryURL": "http://tylershambora.com/resume.pdf",
    "galleryURLAppearance": "resume.pdf",
    "galleryStatus": "online",
     "galleryDescription": "I've spent a great deal of time designing and redesigning my resume, going over numerous iterations until I finally got it into the state it's in today. Initially, it was designed using Adobe Photoshop, however halfway through I thankfully switched to Adobe InDesign, a fantastic tool for working with text heavy documents.",
    "additionalGalleries": [
      [false, "right-image", "resume/resume1.jpg", "One of my favorite features in InDesign, is the fact that text is preserved when saving as a PDF. Unlike Photoshop, which flattens text into an image when saved, documents created in InDesign keep text as text when saved, which means it can be selected, copied, read by screen readers, and even include hyperlinks."],
      [false, "left-image", "resume/resume3.jpg", "In the end, my resume has served as an opportunity for me to flex some of my design skills, show off my sense of humor, and ultimately allowed me to display my creative side."],
      [false, "box-shadow", "resume/resume-bare.jpg", ""]
    ]
  }
}