{
  "laura": {
    "subGallery": true,
    "marqueeImage": "img/marquee/laura.jpg",
    "galleryTitle": "HeyLaura",
    "galleryURL": "http://tylershambora.com/dev/laura/",
    "galleryURLAppearance": "www.heylaura.com",
    "galleryStatus": "online",
    "galleryDescription": "I worked with Author/Editor, Laura McClure to help design and develop her portfolio website in order to showcase her work and her involvement with helping Africa. Her site shares a few things in common with my site; there are no page reloads, you transition to new content in a similar fashion, and various elements share a similar look and feel to elements on my page.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "laura/laura-about.jpg", "Recently, Laura decided to re-brand, which included revamping her web offering. Unfortunately for you and me, that means you won't be able to see the site in its natural habitat on <a href='http://heylaura.com' target='_blank'>heylaura.com</a>. However, I had a fully working version lying around, and I threw it up on my server so the site could live forever in glory."],
      [true, "left-image border push-down-text", "laura/laura-contact.jpg", "This was my first real exposure to JavaScript, and if you look at the code, you can tell (welcome to nested callback hell...). The JavaScript/jQuery plays a big part in that it controls all of the animations and AJAX reloads. <strong>Fun Fact:</strong> While my personal site used to rely on JS for all that fancy stuff, today most of the animations you see (~85%), are performed using CSS3."],
      [false, "right-image push-down-text laura-logo", "laura/logo.jpg", "Finally, one of the more important aspects of working on this project was that it was my first opportunity working with a client and trying to figure out the whole design story. It ended up being a lot more difficult that I anticipated, but I learned early on that design is important (and hard) and is not something to be trifled with."]
    ]
  },
  "resizely": {
    "subGallery": true,
    "marqueeImage": "img/marquee/resize.ly.jpg",
    "galleryTitle": "resize.ly",
    "galleryURL": "http://resize.ly",
    "galleryURLAppearance": "www.resize.ly",
    "galleryStatus": "online",
    "galleryDescription": "resize.ly was my capstone project that I completed with my group for my master's degree at The George Washington University. In so many words, resize.ly accepts an image you submit, along with a new set of dimensions, and intelligently crops the image to the size you specified. It's perfect for  web developers who need images to be a specific size or aspect ratio, but don't want to hassle with constantly resizing images in Photoshop, since all of the magic is done in the cloud.",
    "additionalGalleries": [
      [false, "top-image resizely-bottom-image", "resize.ly/resize.ly-bottom.jpg", "Because a majority of my strengths lies in front-end development, most of my involvement in this project was spend on the visual aspects. This was my first exposure to Twitter Bootstrap, which forced me to learn a lot, including how to properly use a grid framework, and utilize things like icon fonts. I also spent a fair amount of wire-framing and creating mocks before actually building out the site."],
      [false, "top-image", "resize.ly/test.jpg", "This was one of the ideas I had while wire-framing out the site; an in-page tool that let you sample exactly how your images would look if you formatted your url to use our service."]
    ]
  },
  "sns": {
    "subGallery": true,
    "marqueeImage": "img/marquee/sns.jpg",
    "galleryTitle": "Speaker Noise Society",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "offline",
    "galleryDescription": "Speaker Noise Society was one of the two music blogs I helped managed of a period of a couple of years. The entire blog was a custom Wordpress theme that I developed, designed, and installed on my server. Unfortunately, the blog didn't enjoy a very long existence (hence the offline status) but as far as I know, it has since evolved into <a href='https://www.facebook.com/makeitfunkysf' target='_blank'>Make it Funky</a> over on Facebook. In the time it did exist, I served as the main admin, doing adminly duties, like adding new authors and new pages, as necessary.",
    "additionalGalleries": [
      [true, "right-image double-push-down-text", "sns/sns-logo.jpg", "Again, as another attempt to try my chops at a little bit of design, I decided I'd try to design the the Speaker Noise Society Logo, this time in Adoble Illustrator if I remember correctly."]
    ]
  },
  "petershambora": {
    "subGallery": true,
    "marqueeImage": "img/marquee/petershambora.jpg",
    "galleryTitle": "Peter Shambora",
    "galleryURL": "http://petershambora.com",
    "galleryURLAppearance": "www.petershambora.com",
    "galleryStatus": "online",
    "galleryDescription": "PeterShamboraa.com was one of my first websites, and was really just an excuse for me to practice writing markup. That said, I honestly think this is one of my cooler sites. What I really like about this site is that it's like an interactive resume where you can jump around place to place on the page using anchor tags and ids.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "petershambora/petershambora-about.jpg", "Also, as always, this page gave me an opportunity to work on my design skills and learn a few other HTML basics like, <strong>mailto:email@realemail.com'</strong>"]
    ]
  },
  "fb": {
    "subGallery": true,
    "marqueeImage": "img/marquee/fb.jpg",
    "galleryTitle": "Fresh B33ts",
    "galleryURL": "http://freshb33ts.com",
    "galleryURLAppearance": "www.freshb33ts.com",
    "galleryStatus": "online",
    "galleryDescription": "FreshB33ts.com is the other music blog that I helped run and made sure it didn't explode. Freshb33ts actually had a pretty good run, and I would even ghostwrite occasionally for the site. Unlike Speaker Noise Society (which was run on Wordpress), Freshb33ts was run on Blogger, which was a billion times easier for just straight blogging. I had a really good time keeping watch over Freshb33ts and I think the content that we put was actually pretty good. Because of my soft spot for Freshb33ts, I've tried to keep it up and running as long as possible, so as of this writing, Freshb33ts is still alive and well and can be found at <a href='http://freshb33ts.com'>freshb33ts.com</a>.",
    "additionalGalleries": [
      [true, "right-image", "fb/fb-logo.jpg", "As you may notice by now, I like to think I'm good at design so I think it's ok to design every single logo for every single website I author. Whether or not that's actually true is neither here nor there, but here's another logo."]
    ]
  },
  "papn": {
    "subGallery": true,
    "marqueeImage": "img/marquee/papn.jpg",
    "galleryTitle": "Palo Alto Party Network",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "offline",
    "galleryDescription": "Palo Alto Party Network was the first website I ever designed and built. Originally, I was supposed to try and figure out how to integrate the Softpress Freeway editor with the <a href='http://pagelime.com' target='_blank'>PageLime CMS</a>, the company I was interning for at the time. However, after the project was over I wanted to teach myself web design so I decided to make a website for a friend's summer business. The site featured announcements about upcoming parties, a photo gallery from past parties, and a way to buy tickets online.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "papn/papn1.jpg", "The about us page had this cool hand that held these business cards, and on either side there were arrows so you could cycle through each of the business cards and see what each one said. As someone who had never done any web development before, I think it was actually a pretty crafty way of telling people what we did."],
      [true, "left-image border push-down-text", "papn/papn2.jpg", "The Contact Page was my favorite page though, because we each got to pick our own titles. Since I had nothing to do with the parties or throwing them, I deemed myself, <strong>\"Cheif Stuff Maker\"</strong>, since I was in charge of the website and all the Facebook and Twitter stuff. "]
    ]
  },
  "csh": {
    "subGallery": true,
    "marqueeImage": "img/marquee/csh.jpg",
    "galleryTitle": "Casa Street Hooligans",
    "galleryURL": "http://casastreethooligans.com",
    "galleryURLAppearance": "www.casastreethooligans.com",
    "galleryStatus": "online",
    "galleryDescription": "Casa Street Hooligans was a site that I did for free in order to get some experience and to experiment with a tutorial that had to do with an Apple carousel or content slider or something. I figured, instead of putting an item or image on each slide of the carousel, I could just put a page of the website on each slide and then turn the entire carousel into the entire website. Since this was another one of the first websites I made, I thought it was a genius idea and I thought the site ended up looking pretty good.",
    "additionalGalleries": [
      [true, "right-image push-down-text", "csh/csh-bio.jpg", "This is what one of the bio pages looked like. It had: the group member's name, a brief bio, and a way to get into contact with them (along with navigation along the bottom). "],
      [true, "left-image push-down-text", "csh/csh-music.jpg", "Then after all the bios, there was a slide that had Soundcloud widgets embedded into the slide so people could listen to the different group member's music."],
      [true, "right-image push-down-text", "csh/csh-contact.jpg", "Finally, the last slide had a nice little grid if you wanted to get into contact with the collective group (instead of an individual member)."]
    ]
  },
  "wtfdrink": {
    "subGallery": true,
    "marqueeImage": "img/marquee/wtfdrink.jpg",
    "galleryTitle": "WTFDrink",
    "galleryURL": "http://wtfdrink.com",
    "galleryURLAppearance": "www.wtfdrink.com",
    "galleryStatus": "online",
    "galleryDescription": "WTFDrink.com has been my pet project since I started making websites. Initially, the site started out as some basic HTML/CSS + Javascript that I whipped up. However, since then, I've learned some new languages and now the site runs PHP with a MySQL database. It also utilized at one point the new Facebook OpenGraph API and could make posts on your timeline, but unfortunately, Facebook changes their API and the way their stuff works so often, the feature would break like every 36 hours.",
    "additionalGalleries": [
      [true, "right-image border", "wtfdrink/wtfdrink1.jpg", "So the long url for the site is <a href='http://whatthefuckshouldidrinktonight.com' target='_blank' class='massive-url'>whatthefuckshouldidrinktonight</a>, but I figured that was way too long for people to type in to their browsers if they ever wanted to access the site, so you can also get to the site by typing <a href='http://wtfdrink.com' target='_blank'>wtfdrink.com</a>."],
      [true, "left-image border", "wtfdrink/wtfdrink2.jpg", "If you don't drink alcohol, don't fret, there's a section of the site just for you. If you click on 'I don't wanna fucking drink alcohol' you'll be shown a list of drinks that don't contain alcohol."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink3.jpg", "Just as further proof that Fresca isn't the only non-alcoholic option, here's a suggestion for a Shirley Temple!"],
      [true, "left-image border", "wtfdrink/wtfdrink4.jpg", "If you prefer Spanish try, <a href='http://whatthefuckshouldIdrinkestanoche.com' target='_blank' class='massive-url'>whatthefuckshouldidrinkestanoche</a>, and see what kind of options you get in Spanish. While the drinks may not be different, the language certainly is."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink5.jpg", "See, I told you! I wasn't lying! Real life, actual Spanish!"],
      [true, "left-image border", "wtfdrink/wtfdrink6.jpg", "If you're not really in the mood to make a drink, but just want help choosing what kind of liquor you want to drink on any given night, try going to <a href='http://simple.wtfdrink.com' target='_blank'>simple.wtfdrink.com</a>. This version of the site will simply give you a type of liquor that you should try drinking. Nothing more, nothing less."],
      [true, "right-image border push-down-text", "wtfdrink/wtfdrink7.jpg", "If the site still doesn't make sense to you and you still can't figure out what the point of it is, check out the 'About' page and maybe things will become a little more clear for you..."],
      [true, "left-image border", "wtfdrink/wtfdrink8.jpg", "I can't take credit for coming up with the idea on my own. About the time I thought of wtfdrink there were a number of <a href='http://whatthefuckshouldimakefordinner.com' target='_blank'>'whatthefuckshould-.com'</a> sites making the rounds on the Internet. This particular site was the one that got it all started for me, so I thought I'd give it a shout out here on my portfolio page."],
      [true, "right-image border", "wtfdrink/wtfdrink-FB.jpg", "IF/WHEN Facebook decides to be cool and not keep changing everything, this is how the timeline app should look on a person's timeline. That said, WHEN/IF are two very specific conditions that have to be met, which as far as I can tell, aren't met very often."]
    ]
  },
  "cpsolutions": {
    "subGallery": true,
    "marqueeImage": "img/marquee/cpsolutions.jpg",
    "galleryTitle": "CP Solutions",
    "galleryURL": null,
    "galleryURLAppearance": null,
    "galleryStatus": "mock-up",
    "galleryDescription": "CP Solutions Consulting was a mock-up I did for my sister for her consulting firm when she was considering pursuing a website. Fortunately (or unfortunately, depending on how you look at it) she ended up not needing a website, but I was particularly proud of the work that I had done and I think it was deserving of being shown.",
    "additionalGalleries": [
      [true, "right-image border push-down-text", "cpsolutions/cpsolutions-mock.jpg", "This is an image of the Photoshop mock-up still being worked on inside of PS, before a rapid prototype had been built in HTML."],
      [true, "left-image border push-down-text", "cpsolutions/cpsolutions-page.jpg",  "After it's all said and done, this is the rapid mock-up of what the homepage would look like. Not to shabby."]
    ]
  },
  "resume": {
    "subGallery": false,
    "marqueeImage": "img/marquee/resume.jpg",
    "galleryTitle": "Resume",
    "galleryURL": "http://tylershambora.com/resume.pdf",
    "galleryURLAppearance": "resume.pdf",
    "galleryStatus": "online",
     "galleryDescription": "I spent a great deal of time on my resume, going over numerous iterations until I finally got it into the state it's in today. I designed it using Adobe InDesign, which is a fantastic tool for designing text based documents.",
    "additionalGalleries": [
      [false, "right-image resume", "resume/resume1.jpg", "I'd even had some experience with it's predecessor, PageMaker. In my middle school journalism class we'd use PageMaker to design each page of the newspaper. One of the nice things I really like about InDesign is that it preserves fonts when you export, meaning that all the text stays selectable no matter what font you end up using"],
      [false, "left-image resume", "resume/resume3.jpg", "All in all, my resume was an opportunity for me to flex some of my design skills, let a bit of my sense of humor shine through, and ultimately serve as an opportunity to show off a great deal of my creativity."],
      [false, "resume box-shadow", "resume/resume-bare.jpg", ""]
    ]
  }
}